/* $ObjectName=MAFLogonManagerNG_iOS */
/* $Collection=frwk.tools.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable Tool Components */

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Ugyldig parameter";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Ugyldig operasjonskode";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Kan ikke koble til server. Kontroller påloggingsdata.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "Bruker er allerede pålogget";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Operasjon utføres allerede";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Ugyldig operasjonskontekst";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "Ugyldig ID for kommunikasjonsprotokoll";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "Ugyldig aktivitetselement-ID";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Kan ikke fastsette kommunikasjonsprotokoll";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Kontroller passordet";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Denne enheten er allerede registrert på en annen bruker";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "Oppgitte koder stemmer ikke overens";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Operasjonen er ikke tillatt i denne tilstanden";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "Oppgitte påloggingsdata er utilstrekkelige eller ugyldige. Prøv på nytt.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Kan ikke tilbakestille appen. Kontroller at du er koblet til nettverket.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Kan ikke koble til server. Kontroller påloggingsdata.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Kontroller ditt brukernavn og passord";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Kan ikke koble til serveren. Ta kontakt med administrator.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "Oppgitte påloggingsdata er utilstrekkelige eller ugyldige. Prøv på nytt.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Oppgi riktig kode";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Oppgi en kode som inneholder minst ett siffer";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "Oppgitte koder stemmer ikke overens";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "Koden er utløpt. Du må endre den.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Oppgi en kode med minst {0} tegn";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Oppgi en kode som inneholder minst én liten bokstav";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Oppgi en kode som inneholder minst ett spesialtegn";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Oppgi en kode som inneholder minst {0} unike tegn";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Oppgi en kode som inneholder minst én stor bokstav";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Kan ikke hente nøkkel for sertifikat";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Kan ikke hente sertifikat";

/* XMSG */
"keyErrDescrMAFLogonErrorAppSettingsValidation" = "Application Setting property validation failed for key:";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Ukjent feil";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "Sikkert minne finnes allerede";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Datatypefeil";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "Sikkert minne finnes ikke";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Ugyldig argument";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Oppgi riktig kode";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "Sikkert minne er lagret";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Sikkert minne har ikke nok minne";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "Koden er utløpt. Du må endre den.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Oppgi en kode som inneholder minst {0} unike tegn";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Oppgi en kode som inneholder minst ett siffer";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Oppgi en kode som inneholder minst én liten bokstav";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Oppgi en kode som inneholder minst ett spesialtegn";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Oppgi en kode som inneholder minst én stor bokstav";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Oppgi en kode med minst {0} tegn";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Oppgi en kode som inneholder minst {0} unike tegn";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "Sikkert minne er slettet";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Operasjon støttes ikke";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Ugyldig SSO-kode";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Ugyldig Afaria-påloggingsinformasjon";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Finner ikke klient-ID";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Tilgang er avvist";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserInitializationError" = "Cannot instantiate the xml parser.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserError" = "Error during xml parsing.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorSettingsDownloadFailed" = "Settings download failed.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorHTTPDomainError" = "HTTP domain error with response status:";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidJSONData" = "JSON data is invalid";

/* XMSG: message */
"keyErrDescrMAFLogonErrorJSONParserError" = "Error during json parsing";

